app/services/ticket_generator.rb

SELECT COUNT(*) FROM "tickets" INNER JOIN "phases" ON "tickets"."phase_id" = "phases"."id" WHERE "phases"."project_id" = $1  [["project_id", 3]]
---
  def call
    return Result.new(success: false, error_kind: :already_generating) if @project.generating?

    @project.update!(status: "generating")
    @repo_context = fetch_repo_context # scanned before the LLM call
    plan = fetch_valid_plan
    persist!(plan)
    @project.update!(
      status: "ready",
      ticket_count: @project.tickets.count,
      last_generated_at: Time.current
    )

INSERT INTO "phases" ("project_id", "number", "title", "description", "position", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "tickets" ("phase_id", "repo", "title", "body", "position", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def persist!(plan)
    Project.transaction do
      @project.phases.destroy_all

      Array(plan["phases"]).each_with_index do |phase_attrs, p_index|
        phase = @project.phases.create!(
          number: p_index + 1,
          position: p_index,
          title: phase_attrs["title"],
          description: phase_attrs["description"]
        )

        Array(phase_attrs["tickets"]).each_with_index do |ticket_attrs, t_index|
          phase.tickets.create!(
            position: t_index,
            repo: ticket_attrs["repo"],
            title: ticket_attrs["title"],
            body: ticket_attrs["body"]
          )