app/controllers/api/v1/settings/ollama_controller.rb

UPDATE "users" SET "ollama_endpoint" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["ollama_endpoint", "http://ollama.internal:11434"], ["updated_at", "2026-06-01 14:43:15.379870"], ["id", 114]]
---
        def update
          if current_user.update(ollama_params)