app/controllers/api/v1/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 ORDER BY "projects"."created_at" DESC  [["user_id", 1]]
---
      def index
        projects = current_user.projects.order(created_at: :desc)

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 4], ["LIMIT", 1]]
---
      def show
        project = current_user.projects.includes(phases: :tickets).find(params[:id])

INSERT INTO "projects" ("user_id", "name", "description", "github_repo_full_name", "llm_provider", "llm_model", "status", "created_at", "updated_at", "ticket_count", "last_generated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
      def create
        project = current_user.projects.new(project_params)
        if project.save

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 3]]
---
      def destroy
        find_project.destroy

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 3], ["LIMIT", 1]]
---
      def find_project
        current_user.projects.find(params[:id])