app/controllers/api/v1/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 ORDER BY "projects"."created_at" DESC  [["user_id", 1]]
---
      def index
        projects = current_user.projects.order(created_at: :desc)

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 7], ["LIMIT", 1]]
SELECT MAX("tickets"."updated_at") FROM "tickets" INNER JOIN "phases" ON "tickets"."phase_id" = "phases"."id" WHERE "phases"."project_id" = $1  [["project_id", 38]]
---
      def show
        project = current_user.projects.includes(phases: :tickets).find(params[:id])

INSERT INTO "projects" ("user_id", "name", "description", "github_repo_full_name", "llm_provider", "llm_model", "status", "created_at", "updated_at", "ticket_count", "last_generated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "users" ("supabase_user_id", "email", "name", "github_username", "github_access_token", "ollama_endpoint", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
      def create
        project = current_user.projects.new(project_params)
        if project.save

UPDATE "projects" SET "name" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["name", "After"], ["updated_at", "2026-06-01 12:59:53.202674"], ["id", 35]]
---
      def update
        project = find_project
        if project.update(project_params)

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 38]]
---
      def destroy
        find_project.destroy

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 45], ["id", 38], ["LIMIT", 1]]
---
      def find_project
        current_user.projects.find(params[:id])