app/controllers/api/v1/tickets_controller.rb

UPDATE "tickets" SET "status" = $1, "updated_at" = $2 WHERE "tickets"."id" = $3  [["status", "in_progress"], ["updated_at", "2026-06-01 19:13:28.170817"], ["id", 174]]
---
      def update
        ticket = find_ticket

        status = ticket_params[:status]
        unless Ticket.statuses.key?(status)
          return render json: invalid_status_error, status: :unprocessable_entity
        end

        ticket.update!(status: status)

SELECT "tickets".* FROM "tickets" INNER JOIN "phases" ON "phases"."id" = "tickets"."phase_id" INNER JOIN "projects" ON "projects"."id" = "phases"."project_id" WHERE "projects"."user_id" = $1 AND "tickets"."id" = $2 LIMIT $3  [["user_id", 130], ["id", 174], ["LIMIT", 1]]
---
      def find_ticket
        Ticket.joins(phase: :project)
              .where(projects: { user_id: current_user.id })
              .find(params[:id])