app/controllers/api/v1/users_controller.rb

      def update
        if current_user.update(user_params)
---
UPDATE "users" SET "github_access_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["github_access_token", "[FILTERED]"], ["updated_at", "2026-06-01 17:11:08.543911"], ["id", 290]]

      def destroy
        current_user.destroy!
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 245]]