app/models/user.rb

INSERT INTO "users" ("supabase_user_id", "email", "name", "github_username", "github_access_token", "ollama_endpoint", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def self.from_supabase_payload(payload)
    metadata = SupabaseMetadata.new(payload)

    user = find_or_initialize_by(supabase_user_id: metadata.supabase_user_id)
    user.email = metadata.email if metadata.email
    user.name = metadata.name if metadata.name
    user.github_username = metadata.github_username if metadata.github_username
    user.github_access_token = metadata.github_access_token if metadata.github_access_token
    user.save! if user.new_record? || user.changed?